{
  "work": [
    {
      "name": "Car Source Connect",
      "title": "Software Developer",
      "startDate": "Sep 2024",
      "endDate": "Apr 2025",
      "logo": "/csc.png",
      "description": [
        "Built an auction cars valuation model using mainly Pytorch, and Scikit-learn.The model aided in pricing, cutting pricing time by 37% and supported over 200 transactions.",
        "Developed an email automation pipeline to parse invoice emails, extract key details and automatically update the car stock system Easycars - cutting down admin time by 2-3 hours per day and reducing manual entry errors.",
        "Led R&D and MVP development of Autodoc, a SaaS that automates the contract process for the auto industry.",
        "Designed metrics and analytics dashboards using D3 to visualise and improve key dealership workflows."
      ],
      "links": []
    },
    {
      "name": "Sole Trader",
      "title": "Software Developer",
      "startDate": "Jan 2024",
      "endDate": "Present",
      "logo": "/soletrader.png",
      "description": [
        "Scraped and standardized data from 6 car auction sites—over 4M car records warehoused for machine learning pipelines.",
        "Automated daily scraping of live and historical car data to support real-time analytics and model training workflows.",
        "Delivered several Python and Pandas based data/CSV tools to automate laborious manual entry and calculation jobs for private clients working in companies such as: Etax and iTLC.",
        "Maintained a Javascript multi-use Chrome extension for Car Source Connect, enabling users to query and redirect to automotive sales and auctions platforms for similar vehicles as the one they are viewing."
      ],
      "links": []
    },
    {
      "name": "Thales Australia (via University Capstone Project)",
      "title": "Student Software Developer",
      "startDate": "Feb 2022",
      "endDate": "Dec 2022",
      "logo": "/thales.jpg",
      "description": [
        "Led Agile delivery as Scrum Master for a team of 5, coordinating sprints and code reviews in collaboration with senior Thales engineers to meet all project deadlines.",
        "Built a Java-based RAM monitoring tool to log background usage, helping developers present data to leadership and flag inefficient apps—revealing issues in ~29% of workflows."
      ],
      "links": [
        {
          "name": "Company Site",
          "href": "https://www.thalesgroup.com/en",
          "icon": "briefcase"
        }
      ]
    }
  ]
}
